#Translations provides a unified translation system for any scripting purpose,
#or in design-time code.
#Log().level0Error("
#@stringToBeTranslated");
#Log().level2Information("@stringToBeTranslated");
#CASUALInteraction(@interactionStringToBeTranslated).*;
#Note: all @interactions consist of a title and message delimited by >>>. eg.
#@interactionExample=This is a title>>>This is a message
#any other @stringToBeTranslated is directly translated
#Strings may be contatinated by using the delimiting characters " " and "\n" ie..
#Log().level0Error("@string1 mytext @string2\n@string3");

#Interactions display dialogs on screen
@interactionOfflineNotification=Tu dispositivo aparece como fuera de l\u00EDnea>>>Parece que tu dispositivo no est\u00E1 conectado correctamente.\nTu dispositivo est\u00E1 \\\"offline\\\", esto puede ocurrir por varias razones.\n-Por favor, desconecta el dispositivo y recon\u00E9ctalo.\nLuego desbloqu\u00E9alo y busca un mensaje en pantalla.\nSelecciona \'Permitir siempre desde esta computadora\' y luego presiona OK.\n-si eso no funciona reinicia \nla computadora y el dispositivo.
@interactionInsufficientPermissionsWorkaround=Permisos insuficientes>>>Parece que \u00E9sta computadora\nno est\u00E1 configurada correctamente para\ncomunicarse con el dispositivo. Como posible soluci\u00F3n trataremos\nde elevar los permisos para acceder \ncorrectamente al dispositivo.\n
@interactionWindowsDeviceNotDetected=Dispositivo no detectado>>>No hemos detectado tu dispositivo conectado.\nEs posible que necesites instalar drivers\nBusca en internet \\\"windows driver *nombre del dispositivo*\\\" para mas informaci\u00F3n.
@interactionLinuxDeviceNotDetected=Dispositivo no detectado>>>No hemos detectado tu dispositivo conectado.\nEs posible que necesites instalar libusb\nBusca en internet \\\"usar adb en linux *nombre del dispositivo*\\\" para mas informaci\u00F3n.
@interactionMacDeviceNotDetected=Dispositivo no detectado>>>No hemos detectado tu dispositivo conectado.\nEs posible que necesites instalar una kext\nBusca en internet \\\"kext *nombre del dispositivo*\\\" para mas informaci\u00F3n.
@interactionMissingFileVirusScanner=Archivo no encontrado>>>Se ha detectado que la integridad\nde CASUAL ha sido comprometida.\nEsto es probablemente la culpa de un\nantivirus. Por favor, desactiva \ntu antivirus y vuelve a descargar CASUAL.
@interactionKillSwitch=Error Cr\u00EDtico!>>>CASUAL no puede continuar ya que se encontr\u00F3 un error irrecuperable.\nCASUAL te llevar\u00E1 ahora a la p\u00E1gina de ayuda.
@interactionDownloadFileFailure=Error Cr\u00EDtico!>>>La descarga ha fallado. CASUAL se reiniciar\u00E1 ahora.
@interactionBadDownload=Error!>>>Durante la actualizaci\u00F3n un archivo da\u00F1ado se descarg\u00F3.\nPor favor, revisa tu conexi\u00F3n a internet y prueba de nuevo.\nSi el problema persiste, rep\u00F3rtalo.\nCASUAL se cerrar\u00E1 ahora. Por favor, intenta de nuevo.
@interactionsystemNotNativelySupported=Atenci\u00F3n>>>Tu sistema no est\u00E1 soportado nativamente,\npor favor, instala ADB manualmente.\nTratando de continuar.
@interactionELFCLASS64Error=Error ELFCLASS64!>>>No se pudo ejecutar ADB. Error \'Wrong ELF class\'.\nEsto se puede resolver instalando el paquete ia32-libs\n Por ejemplo.. sudo apt-get install ia32-libs\nO bien.. sudo YourPackageManger install ia32-libs
@interactionKillSwitchMessage=Error Cr\u00EDtico!>>>CASUAL no puede continuar ya que se encontr\u00F3 un error irrecuperable.\nCASUAL te llevar\u00E1 ahora a la p\u00E1gina de ayuda.
@interactionPastebinError=Sistema de Env\u00EDo de Reportes>>>Enviaremos tu reporte al Pastebin Automatizado por CASUAL. Los desarrolladores pueden echarle un vistazo y ver qu\u00E9 sucedi\u00F3.\n\nPor favor, ingresa tu usuario de XDA-Developers debajo y presiona \'Ok\'.
@interactionThankyouForPastebin=Gracias!>>>La URL de Pastebin est\u00E1 en el portapapeles\n\nPor favor, post\u00E9alo en el foro correcto.\n Si quisieras tener una devoluci\u00F3n, por favor, completa el captcha.
@interactionUnplugItAndPlugItBackIn=Descon\u00E9ctalo y vuelve a conectarlo>>>Para continuar, debes desconectar el dispositivo\ny conectarlo de nuevo. Usa un puerto que funcione, de los de atr\u00E1s,\nno uno de adelante. Aseg\u00FArate de que el cable tambi\u00E9n funcione.
@interactionwindowsRunAsMessage=Error de permisos>>>Se necesitan permisos de administrador para continuar.\nPor favor, ingresa como Administrador del Sistema y corre de nuevo el comando o en la consola corre: \n runas /user:Administrator java -jar
@interactionDownloadModeNotDetected=No veo el dispositivo>>>Parece que el dispositivo conectado no se pudo reconocer.\nEl dispositivo deber\u00EDa estar en Download Mode.. Lo est\u00E1?.\n\nSi est\u00E1 en Download Mode prueba con otro puerto USB.\nNo uses un USB hub. Ten en cuenta que los puertos de atr\u00E1s\nde la computadora son mejores que los de adelante.
@interactionRestartDownloadMode=Reinicia en Download Mode>>>Debes reiniciar tu dispositivo de nuevo en Download Mode.\nEsto usualmente se hace sacando la bater\u00EDa, poni\u00E9ndola de nuevo\ny apretando Volumen abajo + home, y sin soltarlos, apretando luego power.\nSi no tienes un bot\u00F3n Home, solo mant\u00E9n presionado Volumen abajo\nmientras insertas el cable usb.
@interactionUnableToDetectDownloadMode=Revisa tus cables>>>Heimdall no puede detectar tu tel\u00E9fono en Download Mode\nRevisa la conexi\u00F3n de tus cables, presiona OK cuando termines.  
@interactionPermissionNotFound=Permisos no encontrados!>>>Por favor, instala el paquete \'gksu\' o \'pkexec\' 
@interactionCASUALCorrupt=Se ha detectado que la integridad\nde CASUAL ha sido comprometida.\nEsto es probablemente la culpa de un\nantivirus. Por favor, desactiva \ntu antivirus y vuelve a descargar CASUAL.
@interactionInstallingCADI=CADI>>>CASUAL instalar\u00E1 un driver USB gen\u00E9rico.\n\nEsto permitir\u00E1 que CASUAL se comunique con tu dispositivo\n\nTe gustar\u00EDa que CASUAL desinstale el driver gen\u00E9rico una vez que termine el proceso?
@interactionNeed8gigExternalSD=Inserta una tarjeta SD>>>Inserta una tarjeta SD, se usar\u00E1 como almacenamiento temporal.
@interactionPackageCorrupt=Error>>>El paquete est\u00E1 corrupto. No se puede continuar. Saliendo.
@interactionADBLockedUp=Proceso Bloqueado>>>ADB se bloque\u00F3. Esto generalmente\nrequiere un reinicio. Por favor,\nreinicia tu computadora.
@interactionInstallFastbootDrivers=Se necesitan drivers>>>Por favor, aseg\u00FArate que tienes instalado un\n driver para Fastboot mode para tu dispositivo. Esto no puede instalarse\nautom\u00E1ticamente por el momento.
@interactionUltimateFlashFailure=No ignores esto>>>Se ha detectado que tu dispositivo est\u00E1 comprometido.\n CASUAL debe cerrarse. No apagues el dispositivo. \n Hubo un problema al flashear. Debes\n buscar ayuda en los fotos XDA. Usa ctrl+L para\n abrir el log y luego el bot\u00F3n de pastebin,\n usa el link provisto en tu post en XDA. 
@interactionPairingRequired=El dispositivo no est\u00E1 apareado>>>El dispositivo requiere apareamiento.\nRevisa en el dispositivo para mas informaci\u00F3n.\nTambi\u00E9n revisa el di\u00E1logo para asegurarte que el apareamiento continuar\u00E1.
@interactionFailedToReceive=El archivo no se ha recibido>>>Hubo un problema con la transferencia.\nTratando nuevamente. 
@couldNotObtainRootOnDevice=El dispositivo necesita root>>>No se pudo conseguir root en el dispositivo. La operaci\u00F3n fall\u00F3.
@interactionWaitingForAdb=Buscando dispositivo ADB>>>Estamos esperando que se conecte un dispositivo.\n\nSi a\u00FAn no tienes activado ADB o \"modo desarrollador\", por favor, act\u00EDvalo y vuelve a conectar el dispositivo. 
#Strings display text only onscreen
@restartingADBSlowly=Reiniciando ADB lentamente
@restartingADB=Reiniciando ADB
@permissionsElevationRequired=Problema de permisos detectado. Pidiendo elevaci\u00F3n de permisos para CASUAL.
@improperCASUALversion=Tu versi\u00F3n de CASUAL est\u00E1 obsoleta. CASUAL no puede continuar.
@fileNotFound=Se produjo un error al buscar un archivo. Hay un problema con la continuidad de los datos. Cerrando CASUAL.
@metaDataError=Hay un problema con los metadatos online de este script. Por favor, informa al dessarrollador.
@zipFileCorrupt=El archivo ZIP est\u00E1 corrupto, no se puede continuar.
@shuttingDown=Cerrando
@sleepingfor4Seconds=Esperando por 4 segundos.
@disconnectAndReconnect=Desconecta tu dispositivo y con\u00E9ctalo de nuevo. Revisa el dispositivo para instrucciones.
@unrecognizedDeviceDetected=Dispositivo no reconocido detectado\nSi sigues experimentando problemas, por favor reporta esta falla.
@stateDisconnected=Se envi\u00F3 el comando State Disconnected
@stateConnected=Se envi\u00F3 el comando State Connected
@stateMultipleDevices=Se detectaron m\u00FAltiples dispositivos.
@done=hecho
@canceledDueToMissingFiles=Cancelado por pedido del usuario debido a paquetes comprometidos.
@canceledAtUserRequest=Cancelado por pedido del usuario.
@haltedPerformActions=Detenido. Realiza las acciones requeridas para continuar.
@executingHeimdall=Ejecutando comando Heimdall.
@waitingForDownloadModeDevice=Esperando un dispositivo en modo Download.
@linuxPermissionsElevation=Elevando permisos en Linux.
@waitingForDeviceToBeDetected=Esperando dispositivo en modo ADB. Cuando tu sistema operativo reconozca el dispositivo, continuaremos. No hagas nada.
@scriptComplete=Script Completado
@unrecognizedCommand=Argumento no reconocido durante el inicio. 
@killSwitchMessage=CASUAL se ha detenido debido a actualizaciones cr\u00EDticas. Por favor, lee el mensaje de arriba.
@problemDownloading=Hubo un problema descargando el script. Por favor, revisa tu conexi\u00F3n a internet y trata de nuevo.
@problemDownlaodingFile=Hubo un problema descargando el archivo, por favor, trata de nuevo.
@executeScriptError=CASUALScriptParser().executeSelectedScript: CASUAL encontr\u00F3 un error desconocido. Por favor, reporta esto.
@couldNotFindScript=No se pudo encontrar el script al ejecutar executeSelectedScript en CASUALScriptParser!
@reportThisError=Por favor, reporta este error.
@ioExceptionInExecuteScript=Ocurri\u00F3 una IOException tratando de ejecutar executeSelectedScript en CASUALScriptParser! Probablemente es una descarga corrupta.
@md5sVerified=... Actualizaci\u00F3n exitosa! MD5s verificado!\n@casualIsOutOfDate=ERROR. CASUAL est\u00E1 obsoleto. Esta versi\u00F3n de CASUAL no puede continuar. Mira la siguiente URL para mas informaci\u00F3n.
@scriptIsOutOfDate=Este script esta obsoleto, actualizando...
@metaDataMalformed=Hubo un problema con los metadatos online. Por favor, informa al desarrollador.
@downloadingUpdates=Descargando actualizaciones.
@invalidMD5String=String MD5 inv\u00E1lido...
@deployingFastboot=Iniciando Fastboot...
@fastbootDeployed=Fastboot iniciado.
@incompatibleWithHeimdal=Se ha detectado que este sistema no es compatible con el instalador autom\u00E1tico de Heimdall. Debes compilar e instalar Heimdall desde el c\u00F3digo fuente para continuar.  El c\u00F3digo fuente de Heimdall est\u00E1 en https://github.com/Benjamin-Dobell/Heimdall.
@installingVisualCPP=Instalando el paquete redistribu\u00EDble de Visual C++.\n Necesitar\u00E1s hacer click en \"siguiente\" para instalarlo.
@installingCADI=\nSe necesitan drivers, iniciando CADI\nCASUAL Automated Driver Installer por jrloper.\nInstalando drivers ahora.
@problemWithOnlineRepo=Hubo un problema al acceder al repositorio online.
@additionalFilesAreRequired=Se necesitan archivos adicionales para continuar. Descargando ahora.
@heimdallCouldNotBeDeployed=Hubo un problema iniciando Heimdall.
@heimdallEncounteredAnError=Heimdall encontr\u00F3 un error.
@criticalError=Se encontr\u00F3 un error cr\u00EDtico. Por favor, reporta esta falla con un log.
@problemWhileExecutingCommand=Hubo un problema ejecutando el comando.
@permissionsElevationProblem=El password fall\u00F3 3 veces, tratando con permisos normales.


@heimdallErrorReport=\n *** [Reporte de error de Heimdall ***\n
@couldNotFindResource=No se pudo encontrar el recurso llamado:
@problemParsingScript=Error de Scripting de CASUAL. CASUAL se encontr\u00F3 con un error parseando el comando:
@fileNotAFolder=El archivo especificado no es una carpeta
@failedToWriteFile=Hubo un fallo al escribir el archivo
@criticalErrorWhileCopying=Hubo un error cr\u00EDtico al copiar un archivo
@couldNotCreateFolder=No se pudo crear la carpeta
@couldNotDeleteFile=No se pudo eliminar el archivo
@resourceNotFound=Recurso no encontrado
@fileNotFound=Archivo no encontrado
@maximumRetries=N\u00FAmero m\u00E1ximo de intentos alcanzado. Deteniendo parser.
@removingFolderAndContents=Eliminando carpeta y sus contenidos:
@heimdallWasSucessful=Heimdall tuvo \u00E9xito
@textResourceNotFound=un archivo .txt no se encontr\u00F3 en el script cargado
@CASUALScriptFailed=El script no pudo finalizar. Por favor reporta esto.
@CASUALScriptPassed=El script se complet\u00F3 exitosamente. 
@CouldNotRoot=No se pudo obtener root. Por favor, rootea tu dispositivo e intenta nuevamente.
@NotForYourDevice=Esto no est\u00E1 dise\u00F1ado para tu dispositivo. Esto es para otro dispositivo. No puedes correr esto en tu dispositivo.
@waitingForDownload=Buscando dispositivo en modo Download.
@noUpdateRequired=Tienes la versi\u00F3n mas reciente.
@couldNotCreateTempFolderProperly=Error creando carpeta temporal, no tienes los permisos suficientes.