#Translations provides a unified translation system for any scripting purpose,
#or in design-time code.
#Log().level0Error("@stringToBeTranslated");
#Log().level2Information("@stringToBeTranslated");
#CASUALInteraction(@interactionStringToBeTranslated).*;
#Note: all @interactions consist of a title and message delimited by >>>. eg.
#@interactionExample=This is a title>>>This is a message
#any other @stringToBeTranslated is directly translated
#Strings may be contatinated by using the delimiting characters " " and "\n" ie..
#Log().level0Error("@string1 mytext @string2\n@string3");

#Interactions display dialogs on screen
@interactionOfflineNotification=Votre appareil est d\u00e9tect\u00e9 comme hors ligne.>>>Il semblerait que l'appareil connect\u00e9 n'est pas appair\u00e9 correctement.\nVotre appareil est "hors ligne", cela peut se produire pour plusieurs raisons.\n-Veuillez d\u00e9connecter l'appareil, puis le reconnecter.-\nEnsuite d\u00e9verrouillez l'appareil et v\u00e9rifier s'il y a un message \u00e0 l'\u00e9cran.n\Selectionnez "Toujours autoriser depuis cet ordinateur" puis appuyez sur OK.n\Si \u00e7a ne fonctionne pas, red\u00e9marrez *TOUT*...n\L'ordinateur et le mobile.
@interactionInsufficientPermissionsWorkaround=Privil\u00e8ges insuffisants>>>Il semblerait que cet ordinateur\nne soit pas configur\u00e9 correctement pour communiquer\navec l'appareil.  Une solution serait\nune tentative d'\u00e9l\u00e9vation de privil\u00e8ges \npour acc\u00e9der au mobile correctement.
@interactionWindowsDeviceNotDetected=Appareil introuvable>>>Je n'ai pas d\u00e9tect\u00e9 la connexion de votre appareil.\nIl est possible que vous ayez besoin d'installer des pilotes\nGoogle \"windows driver *votre appareil*\" pour plus d'infos.
@interactionLinuxDeviceNotDetected=Appareil introuvable>>>Je n'ai pas d\u00e9tect\u00e9 la connexion de votre appareil.\n Il est possible que vous ayez besoin d'installer libusb\Google \"utiliser adb linux *votre appareil\" pour plus d'infos.
@interactionMacDeviceNotDetected=Appareil introuvable>>>Je n'ai pas d\u00e9tect\u00e9 la connexion de votre appareil.\nIl est possible que vous deviez installer kext\nGoogle \"kext *Votre appareil*\" pour plus d'infos.
@interactionMissingFileVirusScanner=Fichier manquant>>>Il a \u00e9t\u00e9 d\u00e9tect\u00e9 que l'int\u00e9grit\u00e9 de \nCASUAL a \u00e9t\u00e9 comprise.\nC'est probablement la faute \u00e0 un anti-virus. Veuillez d\u00e9sactiver tout anti-virus et re t\u00e9l\u00e9charger CASUAL
@interactionKillSwitch=ERREUR CRITIQUE!>>>CASUAL ne peut continuer d\u00fb \u00e0 l'activation du \"kill switch\".\CASUAL va vous emmener \u00e0 la page web de support.
@interactionDownloadFileFailure=ERREUR CRITIQUE!>>>\u00c9chec de t\u00e9l\u00e9chargement. CASUAL va se relancer.
@interactionBadDownload=ERREUR!>>>Un fichier a \u00e9t\u00e9 corrompu durant la mise \u00e0 jour.\n Veuillez v\u00e9rifier votre connexion \u00e0 internet puis re essayez.\nSi le probl\u00e8me persiste, rapportez-le.\nCASUAL va maintenant s'\u00e9teindre. Veuillez re essayer.
@interactionsystemNotNativelySupported=Attention>>>Votre syst\u00e8me n'est pas nativement support\u00e9,\nVeuillez installer ADB manuellement.\nTentative de poursuite
@interactionELFCLASS64Error=Erreur ELFCLASS64 !>>>Impossible d'ex\u00e9cuter ADB. Erreur 'Wrong ELF class'\nCe probl\u00e8me peut \u00eatre r\u00e9solu par l'installation de ia32-libs\n ex: sudo apt-get install ia32-libs\nex: VotreGestionaireDePaquets install ia32-libs
@interactionKillSwitchMessage=ERREUR CRITIQUE!>>>CASUAL ne peut continuer \u00e0 cause de l'activation du \"kill-switch\".\n CASUAL va maintenant ouvrir la page web de support.
@interactionPastebinError=Syst\u00e8me d'envois des erreurs.>>>Nous allons envoyer votre journal au Pastebin automatique de CASUAL. Les d\u00e9veloppeurs peuvent le regarder afin de comprendre ce qu'il se passe.\n\nVeuillez entrer votre pseudonyme XDA-Developers sur le champ ci-dessous puis cliquer sur 'Ok'.
@interactionThankyouForPastebin=Merci!>>>Lien Pastebin copi\u00e9 dans le presse-papier\n\nVeuillez le partager dans le bulletin appropri\u00e9 sur le forum.\n Si vous souhaitez avoir des retours, recopiez le captcha.
@interactionUnplugItAndPlugItBackIn=D\u00e9branchez puis rebranchez>>>Pour continuer, d\u00e9branchez l'appareil puis rebranchez le. Utilisez un BON port, \u00e0 l'arri\u00e8re, pas \u00e0 l'avant. Utilisez un bon c\u00e2ble
@interactionwindowsRunAsMessage=Erreur de privil\u00e8ges>>>Les droits d'administrateurs sont requis pour continuer.\nVeuillez vous connecter en tant qu'Administrateur Syst\u00e8me et relancer la commande ou utilisez la console: \n runas /user:Administrateur java -jar
@interactionDownloadModeNotDetected=Je ne vois pas l'appareil>>>Il semblerait que l'appareil connect\u00e9 ne soit pas reconnu. Cet appareil devrait \u00eatre en mode t\u00e9l\u00e9chargement... n'est-ce pas ?\n\nS'il est en mode t\u00e9l\u00e9chargement, utilisez un autre port USB.\nN'utilisez pas un hub USB. De plus, les ports arri\u00e8re sont meilleurs que ceux en fa\u00e7ade.
@interactionRestartDownloadMode=Red\u00e9marrez le mode t\u00e9l\u00e9chargement>>>Vous devez red\u00e9marrer votre appareil en mode t\u00e9l\u00e9chargement.\nCela est g\u00e9n\u00e9ralement accompli en retirant la batterie puis en appuyant\n sur Volume Down + Accueil (Home) en appuyant sur Power.\n Si vous n'avez pas de bouton Accueil, appuyez sur Volume Down\n en branchant le c\u00e2ble USB.
@interactionUnableToDetectDownloadMode=V\u00e9rifiez le c\u00e2ble>>>Heimdall n'a pas pu d\u00e9tecter votre mobile dans Odin/Download Mode\nV\u00e9rifiez la connexion du c\u00e2ble et cliquez sur OK quand vous \u00eates pr\u00eat.
@interactionPermissionNotFound=PERMISSIONS INTROUVABLE>>>Veuillez installer gksu ou pkexec 
@interactionCASUALCorrupt=Il a \u00e9t\u00e9 d\u00e9tect\u00e9 que l'int\u00e9grit\u00e9 de CASUAL a\n \u00e9t\u00e9 compromis. C'est probablement du \u00e0\n un anti-virus. Il est recommand\u00e9 de\n d\u00e9sactiver l'anti-virus et re t\u00e9l\u00e9charger CASUAL.
@interactionInstallingCADI=CADI>>>CASUAL va maintenant installer un pilote USB g\u00e9n\u00e9rique.\n\nCela va permettre la communication entre CASUAL et l'appareil\n\nVoulez-vous que CASUAL retire le pilote une fois l'op\u00e9ration termin\u00e9e ?
@interactionNeed8gigExternalSD=Ins\u00e9rez une carte SD>>>En guise de zone temporaire pour contenir les donn\u00e9es, ins\u00e9rez une carte SD.
@interactionPackageCorrupt=ERREUR>>>Paquet corrompu. Impossible de continuer. Extinction.
@interactionADBLockedUp=Moniteur plant\u00e9>>>ADB a plant\u00e9. Cela requi\u00e8re g\u00e9n\u00e9ralement\n un red\u00e9marrage. \nVeuillez red\u00e9marrer votre ordinateur.
@interactionInstallFastbootDrivers=Installation des pilotes requis>>>Veuillez vous assurer d'avoir les pilotes Fastboot\n correctement install\u00e9 pour votre appareil, \u00e7a ne peut \u00eatre fait\n automatiquement cette fois.
@interactionUltimateFlashFailure=Ne n\u00e9gligez pas ceci>>>Il a \u00e9t\u00e9 d\u00e9tect\u00e9 que votre appareil est compromis.\nCASUAL doit s'arr\u00eater. N'\u00e9teignez pas votre appareil.\nUn probl\u00e8me est survenu lors du flash. Vous devez\nchercher de l'aide sur XDA. Apr\u00e8s avoir lu ceci\nappuyez sur CTRL+L pour ouvrir le journal et utilisez\nle bouton pastebin, utilisez le lien fourni sur les forums de XDA.
@interactionPairingRequired=Appareil non pair\u00e9>>>L'appareil requiert d'\u00eatre appair\u00e9.\nVeuillez regarder l'appareil pour plus d'informations.\nV\u00e9rifiez aussi la bo\u00eete de dialogue pour assurer le pairage.
@interactionFailedToReceive=Impossible de recevoir le fichier>>>Il y a eu un probl\u00e8me avec le transfert de donn\u00e9es.\nNouvel essaie.
@couldNotObtainRootOnDevice=Root requis sur l'appareil>>>Impossible d'obtenir root sur l'appareil. L'op\u00e9ration est un \u00e9chec.
@interactionWaitingForAdb=Recherche d'appareil ADB>>>Nous attendons qu'un appareil soit connect\u00e9.\n\nSi vous n'avez pas activ\u00e9 ADB ou le mode d\u00e9veloppeur, veuillez le faire avant de brancher l'appareil.
#Strings display text only onscreen
@restartingADBSlowly=Red\u00e9marrage lent de ADB
@restartingADB=Red\u00e9marrage de ADB
@permissionsElevationRequired=Probl\u00e8me de privil\u00e8ges d\u00e9tect\u00e9. Requ\u00eate d'\u00e9l\u00e9vation de privil\u00e8ges pour CASUAL.
@improperCASUALversion=Version de CASUAL non \u00e0 jour d\u00e9tect\u00e9. CASUAL ne peut continuer.
@fileNotFound=Fichier non trouv\u00e9 lors de la recherche. Il y a un probl\u00e8me avec la continuit\u00e9 des donn\u00e9es. Extinction.
@metaDataError=Il y a un probl\u00e8me avec les metadonn\u00e9es en ligne pour ce script. Veuillez informer le d\u00e9veloppeur.
@zipFileCorrupt=Archive ZIP corrompue. Impossible de continuer.
@shuttingDown=Extinction
@sleepingfor4Seconds=Pause pour 4 secondes.
@disconnectAndReconnect=D\u00e9connectez et reconnectez l'appareil. V\u00e9rifiez les instructions sur l'appareil.
@unrecognizedDeviceDetected=Appareil d\u00e9tect\u00e9 inconnu\nSi vous rencontrez des probl\u00e8mes, veuillez les rapporter
@stateDisconnected=Demande du statu d\u00e9connect\u00e9.
@stateConnected=Demande du statu connect\u00e9
@stateMultipleDevices=Plusieurs appareils d\u00e9tect\u00e9s.
@done=fini
@canceledDueToMissingFiles=annul\u00e9 sur requ\u00eate de l'utilisateur \u00e0 cause de paquets compromis
@canceledAtUserRequest=annul\u00e9 sur requ\u00eate de l'utilisateur
@haltedPerformActions=Interrompu. Ex\u00e9cutez les t\u00e2ches requises avant de continuer.
@executingHeimdall=Ex\u00e9cution de la commande Heimdall.
@waitingForDownloadModeDevice=En attente de l'appareil en mode t\u00e9l\u00e9chargement.
@linuxPermissionsElevation=\u00e9l\u00e9vation de privil\u00e8ge pour Linux
@waitingForDeviceToBeDetected=Attente de la connexion de votre appareil avec ADB. Quand votre appareil sera reconnu l'ex\u00e9cution se poursuivra. Ne touchez \u00e0 rien.
@scriptComplete=Script termin\u00e9
@unrecognizedCommand=Param\u00e8tre inconnu lors du lancement.
@killSwitchMessage=CASUAL a \u00e9t\u00e9 d\u00e9sactiv\u00e9 suite \u00e0 une mise \u00e0 jour critique. Veuillez lire le message ci-dessus.
@problemDownloading=Il y a eu un probl\u00e8me lors du t\u00e9l\u00e9chargement du script. V\u00e9rifiez l'\u00e9tat de votre connexion p
@problemDownlaodingFile=Probl\u00e8me lors du t\u00e9l\u00e9chargement du fichier, veuillez re essayer.
@executeScriptError=CASUALScriptParser().executeSelectedScript: Une erreur CASUAL inconnue est survenu. Veuillez le rapporter.
@couldNotFindScript=Impossible de trouver le script lors de l'ex\u00e9cution de executeSelectedScript dans l'analyse syntaxique CASUAL!
@reportThisError=Veuillez rapporter cette erreur.
@ioExceptionInExecuteScript=Une erreur IOException s'est produite en tentant d'ex\u00e9cuter executeSelectedScript lors de l'analyse syntaxique CASUAL! Le t\u00e9l\u00e9chargement est probablement corrompu.
@md5sVerified=... Mise \u00e0 jour effectu\u00e9 avec succ\u00e8s ! MD5 v\u00e9rifi\u00e9s !
@casualIsOutOfDate=ERREUR. CASUAL n'est pas \u00e0 jour. Cette version de CASUAL ne peut continuer plus loin. Veuillez suivre le lien pour plus d'informations.
@scriptIsOutOfDate=Le script n'est pas \u00e0 jour, mise-\u00e0-jour...
@metaDataMalformed=Un probl\u00e8me est survenu avec les m\u00e9ta donn\u00e9es en ligne.  Veuillez informer le d\u00e9veloppeur.
@downloadingUpdates=T\u00e9l\u00e9chargement des mises-\u00e0-jour.
@invalidMD5String=Somme MD5 invalide
@deployingFastboot=D\u00e9ploiement de Fastboot...
@fastbootDeployed=Fastboot d\u00e9ploy\u00e9.
@incompatibleWithHeimdal=Le syst\u00e8me a \u00e9t\u00e9 d\u00e9tect\u00e9 comme incompatible avec l'installation automatique de Heimdall. Vous devez compiler et installer heimdall depuis les sources pour continuer. Les sources sont disponibles sur https://github.com/Benjamin-Dobell/Heimdall.
@installingVisualCPP=Installation de Visual C++ redistributable package\n Vous devrez cliquer sur suivant pour poursuivre l'installation
@installingCADI=\nDes pilotes sont requis pour lancer CADI.\nInstalleur de pilotes automatique CASUAL par jrloper.\nInstallation des pilotes
@problemWithOnlineRepo=Un probl\u00e8me est survenu lors de l'acc\u00e8s au d\u00e9p\u00f4t.
@additionalFilesAreRequired=Des fichiers suppl\u00e9mentaires sont requis afin de continuer... T\u00e9l\u00e9chargement en cours."
@heimdallCouldNotBeDeployed=Un probl\u00e8me est survenu lors du d\u00e9ploiement de heimdall.
@heimdallEncounteredAnError=Heimdall a rencontr\u00e9 une erreur.
@criticalError=Une erreur critique s'est produite. Veuillez rapporter l'erreur avec le journal.
@problemWhileExecutingCommand=Un probl\u00e8me est survenu lors de l'ex\u00e9cution de la commande.
@permissionsElevationProblem=Mot de passe incorrect 3 fois, tentative avec privil\u00e8ges classique


@heimdallErrorReport=\n *** [Rapport d'erreur Heimdall ***\n
@couldNotFindResource=Impossible de trouver la ressource nomm\u00e9e:
@problemParsingScript=Erreur script CASUAL. Une erreur s'est produite lors de l'ex\u00e9cution de la commande:
@fileNotAFolder=Le chemin sp\u00e9cifi\u00e9 n'est pas un dossier
@failedToWriteFile=Erreur lors de l'\u00e9criture du fichier
@criticalErrorWhileCopying=Erreur critique lors de la copie du fichier
@couldNotCreateFolder=Impossible de cr\u00e9er le dossier
@couldNotDeleteFile=Impossible d'effacer le fichier
@resourceNotFound=Ressource introuvable
@fileNotFound=Fichier non trouv\u00e9
@maximumRetries=Maximum d'essaies d\u00e9pass\u00e9s. Extinction de l'analyseur syntaxique.
@removingFolderAndContents=Suppression des dossiers et contenus:
@heimdallWasSucessful=Heimdall a r\u00e9ussi
@textResourceNotFound=Un fichier .txt \u00e9tait manquant sur le script charg\u00e9
@CASUALScriptFailed=Le script n'a pas pus terminer. Veuillez rapporter l'erreur
@CASUALScriptPassed=Le script c'est termin\u00e9 avec succ\u00e8s
@CouldNotRoot=Impossible d'obtenir les droits root. Rootez votre appareil et r\u00e9essayez
@NotForYourDevice=Ce n'est pas pr\u00e9vu pour votre appareil, c'est pour un autre appareil. Vous ne pouvez pas ex\u00e9cuter ceci sur votre appareil.
@waitingForDownload=Recherche d'appareil en mode t\u00e9l\u00e9chargement.
@noUpdateRequired=V\u00e9rifi\u00e9, tout est \u00e0 jour.
@couldNotCreateTempFolderProperly=Erreur lors de la cr\u00e9ation du dossier temporaire. Privil\u00e8ges insuffisant